{"searchTerm":"quimica","prefix":"What is","maximunSentences":7,"sourceContentOriginal":"Física o Química (English: Physics or Chemistry) was a Spanish teen drama television series produced by Antena 3 that ran from February 2008 to June 2011.Before its televised broadcast, Física o Química was released on cellphones in Vodafone live! and on the official website of Antena 3. After the success of the first season, which ended on 31 March 2008, Antena 3 announced the filming of a new season which would feature more episodes and few cast changes. The second season premiered on 8 September 2008, with guest appearances by Michel Brown and María Casal, among others; it ended on 8 December 2008. The third season premiered on 13 April 2009 and included new characters portrayed by Óscar Sinela, Sandra Blázquez, Miriam Giovanelli, Adrián Rodríguez, Irene Sánchez and José Manuel Seda, and the entry of character actor Álex Barahona who had already appeared on the show, thus compensating for the departure of Michel Brown, Andrés Cheung, Karim El-Kerem and Xavi Mira. Antena 3 confirmed the filming of the fourth season with Adrián Rodríguez as a regular character and the return of Leonor Martín.\nFísica o Química started its seventh season with the departure of Nuria González, Úrsula Corberó, Angy Fernández and José Manuel Seda. Filming began on 28 February 2011. In May 2011 the series was cancelled due to a fall in viewing figures (more than 50% from the previous few seasons). On 1 June 2011, the death of a main character caused considerable outcry on the Antena 3 website.The two-episode sequel miniseries Física o Química: el reencuentro was released in 2020.\n\n\n== Cast and characters ==\n\n\n=== Students ===\nAndrea Duro as Yolanda \"Yoli\" Freire Caballar\nJavier Calvo as Fernando \"Fer\" Redondo Ruano\nSandra Blázquez as Alma Núñez (season 3–7)\nAdrián Rodríguez as David Ferrán (season 4–7; recurring season 3)\nLucía Ramos as Teresa Parra (season 5–7)\nÀlex Batllori as Álvaro (season 5–7)\nNasser Saleh as Rashid \"Román\" Lorente (season 5–7)\nLorena Mateo as Daniela Vaquero (season 6–7; recurring season 5)\nAlex Hernández as Jon (season 6–7)\nÁlex Martínez as Salvador \"Salva\" Quintanilla (season 6–7)\nKarim El-Kerem as Isaac Blasco, Zurbarán student and ex-lover of Irene. Dies due to injuries suffered in a quad accident. (season 1–2)\nAndrés Cheung as Jan Taeming, Zurbarán student. Returns to China after entering an arranged marriage to his cousin. (season 1–2; guest season 7)\nAngy Fernández as Paula Blasco (season 1–6; guest season 7)\nÚrsula Corberó as Ruth Gómez (season 1–6; guest 7)\nLeonor Martín as Covadonga \"Cova\" Ariste, Zurbarán student and girlfriend of Julio (season 1–3; recurring season 5–6; guest season 7)\nAdam Jezierski as Gorka Casas (season 1–5; recurring season 6; guest season 7)\nMaxi Iglesias as César Cabano de Vera (season 1–5; guest season 7)\nGonzalo Ramos as Julio de la Torre (season 1–6; guest season 7)\nIrene Sánchez as Violeta Calvo, Zurbarán student (season 3–4)\nÓscar Sinela as Joaquín \"Quino\", Zurbarán student (season 3–4)\n\n\n=== Zurbarán School staff ===\nAna Milán as Olimpia Díaz, English language teacher and former principal.\nMarc Clotet as Vicente Vaquero, Gymnastic teacher (season 4–7)\nOlivia Molina as Verónica Lebrón, Language and literature teacher and the mother of Teresa (season 5–7)\nEnrique Arce as Arturo Ochando, Biology teacher and school doctor (season 7; recurring season 6)\nFernando Andina as Enrique Lubián, History teacher and principal (season 7)\nSabrina Garciarena as Sara Pires, Philosophy teacher (season 7)\nJuan Pablo Di Pace as Xavier \"Xavi\" López, Arts teacher (season 7)\nMichel Gurfi as Jonathan, former physical education teacher and love interest of Blanca. Leaves Zurbarán to return to Mexico. (season 1)\nXavi Mira as Félix, music and technical drawing teacher. Leaves Colegio Zurbarán after his wife Olympia ultimately chooses Roque over him. (season 1–2; guest season 3, 5 and 7)\nMichel Brown as Miguel Beleza, the Argentine history and drama teacher (season 2)\nJoaquín Climent as Adolfo Madroña Bermúdez, Director of Studies and father of Roque. (season 1–4; guest season 7)\nCecilia Freire as Blanca Román, Language and literature teacher and best friend and roommate of Irene. (season 1–4; guest season 7)\nBlanca Romero as Irene Calvo, Zurbarán's Philosophy professor (season 1–4; guest season 7)\nBart Santana as Roque Madroña Castro, Art teacher (season 1–5)\nÁlex Barahona as Berto Freire Caballar, Cafeteria Waiter and the brother of Yoli (season 3–6; recurring season 2; guest season 7)\nNuria González as Clara Yáñez, English language teacher and former principal. (season 1–6; guest season 7)\nJosé Manuel Seda as Martín Aguilar, former school psychologist and former principal (season 3–6; guest season 7)\nCristina Alcázar as Marina Conde, Philosophy teacher (season 5–6; guest season 7)\nSergio Mur as Jorge, Arts teacher and former school psychologist (season 6; recurring season 5)\n\n\n=== Recurring characters ===\nFele Martínez as Mario Barrio, the former boyfriend of Irene. He leaves after realizing she is sleeping with Isaac. (season 1; guest season 2)\nJulio Soler as Rubén de la Torre, Julio's brother who kills himself in the pilot (season 1)\nNancy Yao as Xiao Mei, the wife and cousin of Jan (season 2)\nVerónica Moral as Leonor \"Leo\" Grandes Álvarez, Roque's controlling ex-wife and mother of his daughter Alba. She leaves for the United States with Alba, but returns with news that their daughter is ill. (season 2)\nÁlex Yuste as Márquez, former boyfriend of Fer and student of Zurbarán (season 1–2)\nCarlos Wu as Mr. Taeming, Jan's Chinese father who owns a convenience store in town (season 1–2)\nSantiago Meléndez as Mr. Cabano, Cesar Cabano's abusive father (season 1–2)\nAura Garrido as Erica, Alma's former love. (season 3)\nMiriam Giovanelli as Lucía, Julio's former girlfriend , Rodrigo's sister and student of Zurbarán (season 3)\nXimena Suárez as Marta, gym teacher at Colegio Zurbarán (season 2–3)\nCarlos Velasco as Rodrigo \"Rodri\" Prieto, Julio's enemy and Lucía's brother (season 2–3)\nMaría Casal as Marisa, Adolfo's ex-wife and Roque's mother, whom he leaves for Loli. It's too education inspector (season 2–4)\nMark Schardan as Thomas, Irene's American boyfriend (season 3–4)\nAida de la Cruz as Andrea, a cancer patient (season 4)\nOlivier Morellón as Oliver, Zurbarán student (season 1–4)\nChristian Martin as Javier Moreno, Zurbarán student (season 1–6)\nItaca López Martínez as Laura, Zurbarán student (season 1–4)\nArantxa Aranguren as Matilde Martínez, Gorka's mother. She becomes the school janitor, much to the embarrassment of Gorka. (season 1–5)\nJaime Pujol as Alonso de la Torre, Julio and Reuben's father (season 4–5)\nMarina Gatell as Sandra, stripper and mother of Martin's daughter (season 5)\nRamiro Blas as Ricardo López, Clara's boyfriend and Zurbarán's plumber (season 6)\nDiego Ramírez as Diego, Paula's love interest and librarian assistant (season 6)\nTeresa Arbolí as Dolores \"Loli\" Prieto, Paula and Isaac's mother and Adolfo's former lover (season 1–6)\nIsrael Rodríguez as Borja, Fer's boyfriend (season 6)\nIsaak Ferriz as Luís Parra, Teresa's father (season 5–6)\nFarah Hamed as Fátima, Rashid's mother (season 6)\nAndrea Dueso as Susana, David's ex-girlfriend (season 7)\nVictor Palmero as Toño, Zurbarán student (season 7)\nPablo Espinosa as Pablo Calleja, Zurbarán student (season 3–4)\n\n\n=== Guest stars and cameos ===\nNacho Cano as himself\nEl Sueño de Morfeo as themselves\nLiz Solari and Tomás de las Heras as Charlotte and Gonzalo respectively, from the show Champs 12.\nAna Fernández García and Luis Fernández \"Perla\" as themselves; crossover with the television series Los protegidos.\nDespistaos as themselves\nDJ Nano as himself\nAdriana Torrebejano as Cristina\n\n\n== Scenarios ==\n\n\n=== Zurbarán High School ===\nHS is where most of the drama takes part. The rooms, the cafeteria, the library, the hallways, the elevator, the teachers' room, the bathrooms... The building becomes the scenario for most of the interactions among students and teachers.\n\n\n=== Teachers' house ===\nThe home of Irene (Blanca Romero) and Blanca (Cecilia Freire) is a flat always occupied by other teachers such as Miguel, (Michel Brown), Violeta (Irene Sánchez), or Irene's nephew. After this last one left, the free room was taken by Vaquero (Marc Clotet), who stays in the flat after Irene and Blanca finally leave.\nLater on, Vaquero rents the free rooms Verónica (Olivia Molina) and Jorge (Sergio Mur). Because of the constant flirting going on between these two, Vaquero decides to leave the flat, to the couple, but after they break up, Jorge leaves too.\nCurrently the flat is shared by Verónica (Olivia Molina), Sara (Sabrina Garciarena) and Xavi (Juan Pablo Di Pace).\n\n\n=== Other scenarios ===\nThe students' houses, restaurants and even the street are also scenarios used in this TV show.\n\n\n== Episodes ==\n\n\n=== Season 1 (2008) ===\n\n\n=== Season 2 (2008) ===\n\n\n=== Season 3 (2009) ===\n\n\n=== Season 4 (2009) ===\n\n\n=== Season 5 (2010) ===\n\n\n=== Season 6 (2010) ===\n\n\n=== Season 7 (2011) ===\n\n\n== Broadcasters ==\n\n\n== Sequel ==\nA two-episode sequel miniseries, Fisica o Química: el reencuentro, which reunites some of the main characters from the original series nine years later for Yoli's wedding, premiered on 27 December 2020 on streaming platform Atresplayer Premium.\n\n\n== References ==\n\n\n== External links ==\nOfficial website\nFísica o Química on IMDb","sourceContentSanitized":"Física o Química was a Spanish teen drama television series produced by Antena 3 that ran from February 2008 to June 2011.Before its televised broadcast, Física o Química was released on cellphones in Vodafone live! and on the official website of Antena 3. After the success of the first season, which ended on 31 March 2008, Antena 3 announced the filming of a new season which would feature more episodes and few cast changes. The second season premiered on 8 September 2008, with guest appearances by Michel Brown and María Casal, among others; it ended on 8 December 2008. The third season premiered on 13 April 2009 and included new characters portrayed by Óscar Sinela, Sandra Blázquez, Miriam Giovanelli, Adrián Rodríguez, Irene Sánchez and José Manuel Seda, and the entry of character actor Álex Barahona who had already appeared on the show, thus compensating for the departure of Michel Brown, Andrés Cheung, Karim El-Kerem and Xavi Mira. Antena 3 confirmed the filming of the fourth season with Adrián Rodríguez as a regular character and the return of Leonor Martín. Física o Química started its seventh season with the departure of Nuria González, Úrsula Corberó, Angy Fernández and José Manuel Seda. Filming began on 28 February 2011. In May 2011 the series was cancelled due to a fall in viewing figures . On 1 June 2011, the death of a main character caused considerable outcry on the Antena 3 website.The two-episode sequel miniseries Física o Química: el reencuentro was released in 2020. Andrea Duro as Yolanda \"Yoli\" Freire Caballar Javier Calvo as Fernando \"Fer\" Redondo Ruano Sandra Blázquez as Alma Núñez Adrián Rodríguez as David Ferrán Lucía Ramos as Teresa Parra Àlex Batllori as Álvaro Nasser Saleh as Rashid \"Román\" Lorente Lorena Mateo as Daniela Vaquero Alex Hernández as Jon Álex Martínez as Salvador \"Salva\" Quintanilla Karim El-Kerem as Isaac Blasco, Zurbarán student and ex-lover of Irene. Dies due to injuries suffered in a quad accident. Andrés Cheung as Jan Taeming, Zurbarán student. Returns to China after entering an arranged marriage to his cousin. Angy Fernández as Paula Blasco Úrsula Corberó as Ruth Gómez Leonor Martín as Covadonga \"Cova\" Ariste, Zurbarán student and girlfriend of Julio Adam Jezierski as Gorka Casas Maxi Iglesias as César Cabano de Vera Gonzalo Ramos as Julio de la Torre Irene Sánchez as Violeta Calvo, Zurbarán student Óscar Sinela as Joaquín \"Quino\", Zurbarán student Ana Milán as Olimpia Díaz, English language teacher and former principal. Marc Clotet as Vicente Vaquero, Gymnastic teacher Olivia Molina as Verónica Lebrón, Language and literature teacher and the mother of Teresa Enrique Arce as Arturo Ochando, Biology teacher and school doctor Fernando Andina as Enrique Lubián, History teacher and principal Sabrina Garciarena as Sara Pires, Philosophy teacher Juan Pablo Di Pace as Xavier \"Xavi\" López, Arts teacher Michel Gurfi as Jonathan, former physical education teacher and love interest of Blanca. Leaves Zurbarán to return to Mexico. Xavi Mira as Félix, music and technical drawing teacher. Leaves Colegio Zurbarán after his wife Olympia ultimately chooses Roque over him. Michel Brown as Miguel Beleza, the Argentine history and drama teacher Joaquín Climent as Adolfo Madroña Bermúdez, Director of Studies and father of Roque. Cecilia Freire as Blanca Román, Language and literature teacher and best friend and roommate of Irene. Blanca Romero as Irene Calvo, Zurbarán's Philosophy professor Bart Santana as Roque Madroña Castro, Art teacher Álex Barahona as Berto Freire Caballar, Cafeteria Waiter and the brother of Yoli Nuria González as Clara Yáñez, English language teacher and former principal. José Manuel Seda as Martín Aguilar, former school psychologist and former principal Cristina Alcázar as Marina Conde, Philosophy teacher Sergio Mur as Jorge, Arts teacher and former school psychologist Fele Martínez as Mario Barrio, the former boyfriend of Irene. He leaves after realizing she is sleeping with Isaac. Julio Soler as Rubén de la Torre, Julio's brother who kills himself in the pilot Nancy Yao as Xiao Mei, the wife and cousin of Jan Verónica Moral as Leonor \"Leo\" Grandes Álvarez, Roque's controlling ex-wife and mother of his daughter Alba. She leaves for the United States with Alba, but returns with news that their daughter is ill. Álex Yuste as Márquez, former boyfriend of Fer and student of Zurbarán Carlos Wu as Mr. Taeming, Jan's Chinese father who owns a convenience store in town Santiago Meléndez as Mr. Cabano, Cesar Cabano's abusive father Aura Garrido as Erica, Alma's former love. Miriam Giovanelli as Lucía, Julio's former girlfriend , Rodrigo's sister and student of Zurbarán Ximena Suárez as Marta, gym teacher at Colegio Zurbarán Carlos Velasco as Rodrigo \"Rodri\" Prieto, Julio's enemy and Lucía's brother María Casal as Marisa, Adolfo's ex-wife and Roque's mother, whom he leaves for Loli. It's too education inspector Mark Schardan as Thomas, Irene's American boyfriend Aida de la Cruz as Andrea, a cancer patient Olivier Morellón as Oliver, Zurbarán student Christian Martin as Javier Moreno, Zurbarán student Itaca López Martínez as Laura, Zurbarán student Arantxa Aranguren as Matilde Martínez, Gorka's mother. She becomes the school janitor, much to the embarrassment of Gorka. Jaime Pujol as Alonso de la Torre, Julio and Reuben's father Marina Gatell as Sandra, stripper and mother of Martin's daughter Ramiro Blas as Ricardo López, Clara's boyfriend and Zurbarán's plumber Diego Ramírez as Diego, Paula's love interest and librarian assistant Teresa Arbolí as Dolores \"Loli\" Prieto, Paula and Isaac's mother and Adolfo's former lover Israel Rodríguez as Borja, Fer's boyfriend Isaak Ferriz as Luís Parra, Teresa's father Farah Hamed as Fátima, Rashid's mother Andrea Dueso as Susana, David's ex-girlfriend Victor Palmero as Toño, Zurbarán student Pablo Espinosa as Pablo Calleja, Zurbarán student Nacho Cano as himself El Sueño de Morfeo as themselves Liz Solari and Tomás de las Heras as Charlotte and Gonzalo respectively, from the show Champs 12. Ana Fernández García and Luis Fernández \"Perla\" as themselves; crossover with the television series Los protegidos. Despistaos as themselves DJ Nano as himself Adriana Torrebejano as Cristina HS is where most of the drama takes part. The rooms, the cafeteria, the library, the hallways, the elevator, the teachers' room, the bathrooms... The building becomes the scenario for most of the interactions among students and teachers. The home of Irene and Blanca is a flat always occupied by other teachers such as Miguel, , Violeta , or Irene's nephew. After this last one left, the free room was taken by Vaquero , who stays in the flat after Irene and Blanca finally leave. Later on, Vaquero rents the free rooms Verónica and Jorge . Because of the constant flirting going on between these two, Vaquero decides to leave the flat, to the couple, but after they break up, Jorge leaves too. Currently the flat is shared by Verónica , Sara and Xavi . The students' houses, restaurants and even the street are also scenarios used in this TV show. A two-episode sequel miniseries, Fisica o Química: el reencuentro, which reunites some of the main characters from the original series nine years later for Yoli's wedding, premiered on 27 December 2020 on streaming platform Atresplayer Premium. Official website Física o Química on IMDb","sentences":[{"text":"Física o Química was a Spanish teen drama television series produced by Antena 3 that ran from February 2008 to June 2011","keywords":["Spanish teen drama television series","Antena","June","Física","Química","February"],"images":["https://d1bvpoagx8hqbg.cloudfront.net/originals/best-spanish-tv-shows-learn-language-a7caa035f4424d9fd974140690eea0cc.jpg","https://m.media-amazon.com/images/M/MV5BYjU1M2Y3ZDctZGYxMS00NmQ5LWE1MzQtYzYyZTQxZjEyYWQ1XkEyXkFqcGdeQXVyMTAyNjg4NjE0._V1_UY268_CR9,0,182,268_AL_.jpg"],"googleSearchQuery":"quimica Spanish teen drama television series"},{"text":"Before its televised broadcast, Física o Química was released on cellphones in Vodafone live!","keywords":["broadcast","cellphones","Vodafone","Física","Química"],"images":["https://m.media-amazon.com/images/M/MV5BYjU1M2Y3ZDctZGYxMS00NmQ5LWE1MzQtYzYyZTQxZjEyYWQ1XkEyXkFqcGdeQXVyMTAyNjg4NjE0._V1_UY268_CR9,0,182,268_AL_.jpg","https://miro.medium.com/max/680/1*KqEn9AfpIKArVE95peqZZA.jpeg"],"googleSearchQuery":"quimica broadcast"},{"text":"and on the official website of Antena 3.","keywords":["official website of Antena"],"images":["https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Antena_3_%282017%29.svg/1200px-Antena_3_%282017%29.svg.png","https://imagenes.20minutos.es/files/image_656_370/uploads/imagenes/2020/12/17/fisica-o-quimica.jpeg"],"googleSearchQuery":"quimica official website of Antena"},{"text":"After the success of the first season, which ended on 31 March 2008, Antena 3 announced the filming of a new season which would feature more episodes and few cast changes.","keywords":["success of the first season","filming of a new season","Antena","March","episodes","cast changes"],"images":["https://i.ytimg.com/vi/bFyhZtkZUBY/maxresdefault.jpg","https://i.pinimg.com/564x/3c/56/8b/3c568b722e207025434717472e5bfeb4.jpg"],"googleSearchQuery":"quimica success of the first season"},{"text":"The second season premiered on 8 September 2008, with guest appearances by Michel Brown and María Casal, among others; it ended on 8 December 2008.","keywords":["second season","guest appearances","September","Michel Brown","others","December","María Casal"],"images":["https://i.jeded.com/i/fisica-o-quimica-second-season.22626.jpg","http://www.ciceco.ua.pt/images/croped/qdc.jpg"],"googleSearchQuery":"quimica second season"},{"text":"The third season premiered on 13 April 2009 and included new characters portrayed by Óscar Sinela, Sandra Blázquez, Miriam Giovanelli, Adrián Rodríguez, Irene Sánchez and José Manuel Seda, and the entry of character actor Álex Barahona who had already appeared on the show, thus compensating for the departure of Michel Brown, Andrés Cheung, Karim El-Kerem and Xavi Mira.","keywords":["third season","new characters","entry of character actor Álex Barahona","José Manuel Seda","Óscar Sinela","Sandra Blázquez","Miriam Giovanelli","April","Adrián Rodríguez","Irene Sánchez","departure of Michel Brown","Andrés Cheung","Karim El-Kerem","Xavi Mira","show"],"images":["https://images-na.ssl-images-amazon.com/images/I/71QFS60K4rL.jpg","https://i.jeded.com/i/fisica-o-quimica-third-season.154-26979.jpg"],"googleSearchQuery":"quimica third season"},{"text":"Antena 3 confirmed the filming of the fourth season with Adrián Rodríguez as a regular character and the return of Leonor Martín.","keywords":["regular character","filming of the fourth season","Antena","Adrián Rodríguez","return of Leonor Martín"],"images":["https://i.pinimg.com/originals/ff/9b/55/ff9b55ad6cd6d853f36614520f395276.png","https://m.media-amazon.com/images/M/MV5BYjU1M2Y3ZDctZGYxMS00NmQ5LWE1MzQtYzYyZTQxZjEyYWQ1XkEyXkFqcGdeQXVyMTAyNjg4NjE0._V1_UY268_CR9,0,182,268_AL_.jpg"],"googleSearchQuery":"quimica regular character"}]}